{
  "posts": [
    {
      "title": "The Dry’ Is a Mystery Full of Small-Town Secrets, Suspicions",
      "content": "<p>Robert Connolly’s new film, The Dry, is a mystery at heart: An investigation into a small-town murder-suicide that inevitably kicks up the dust of other peoples’ secrets and picks the scabs on barely-healed wounds. Yet for all its depiction of police procedure and the ins and outs of investigation, it’s this other stuff — much of it backstory — that radiates from the film’s center. The circumstances of the crime, specifically the secrets of the man who ostensibly committed it, bleed into matters of the heart, and of memory. And of a sense of guilt that far surpasses this crime in itself. Yet the resolution of that crime — the actual, substantive answer to the whodunit — is almost secondary. Petty, really. Whereas what cannot be resolved by such tragedies looms — nearly suffocates.The movie, based on the 2016 bestseller by Jane Harper, stars Eric Bana as Aaron Falk, a federal police officer called back to his hometown of Kiewarra, in Australia’s Western Victoria, by a stark, accusatory letter. “Luke lied. You lied. Be at the funeral.” Luke: Aaron’s childhood friend, now dead, apparently by his own hand. So are his wife and oldest child. Only an infant remains. Well — and that lie, that known unknown that drives Aaron back home and leaves the facade of his adult successes as cracked and parched as the water-sapped terrain of Kiewarra.</p>",
      "id": "1222444444"
    },
    {
      "title": "Sen. Ron Johnson Doesn’t Care If Your Wages Don’t Cover Childcare. ‘The Marketplace’ Has Spoken",
      "content": "<p>Sen. Ron Johnson (R-Wisc.), who collects a $174,000 salary, thinks that there is a “downside” to paying workers a living wage enough to cover expenses such as childcare. Johnson made his remarks while appearing on WKOW-TV to defend his support of a bill in the Wisconsin state legislature that would end the $300 per week federal unemployment subsidy in the state — a bill the Democratic governor has said he will likely veto.</p>",
      "id": "1222444444"
    }
  ]
}